Repository: fauzipadlaw/thinkr
Catalog: lib/l10n/app_*.arb
Languages: id

# home_title
source: What do you want to decide today?
id: Mau mengambil keputusan apa hari ini?

# home_newDecision
source: New decision
id: Keputusan baru

# home_history
source: History
id: Riwayat

# home_recentDecisions
source: Recent decisions
id: Keputusan terbaru

# home_viewAllHistory
source: See all history
id: Lihat semua riwayat

# login_signIn
source: Sign in
id: Masuk

# login_signOut
source: Sign out
id: Keluar

# login_subtitleSignin
source: Welcome back. Sign in to continue.
id: Selamat datang kembali. Masuk untuk melanjutkan.

# login_subtitleSignup
source: Create an account to save your decisions.
id: Buat akun untuk menyimpan keputusanmu.

# login_password
source: Password
id: Kata sandi

# login_confirmPassword
source: Confirm password
id: Konfirmasi kata sandi

# login_emailRequired
source: Email is required
id: Email wajib diisi

# login_emailInvalid
source: Enter a valid email address
id: Masukkan email yang valid

# login_passwordRequired
source: Password is required
id: Kata sandi wajib diisi

# login_passwordTooShort
source: Password must be at least 6 characters
id: Kata sandi minimal 6 karakter

# login_passwordMismatch
source: Passwords do not match
id: Kata sandi tidak sama

# login_signinCta
source: Sign in
id: Masuk

# login_signupCta
source: Create account
id: Buat akun

# login_needAccount
source: Need an account? Sign up
id: Belum punya akun? Daftar

# login_haveAccount
source: Already have an account? Sign in
id: Sudah punya akun? Masuk

# login_orContinueWith
source: or continue with
id: atau lanjut dengan

# login_signinSuccess
source: Signed in
id: Berhasil masuk

# login_signupSuccess
source: Account created
id: Akun berhasil dibuat

# history_title
source: Decision history
id: Riwayat keputusan

# history_emptyTitle
source: No decisions yet
id: Belum ada keputusan

# history_emptySubtitle
source: Create a decision to see it here.
id: Buat keputusan untuk melihat di sini.

# history_newDecision
source: New decision
id: Keputusan baru

# history_options
source: options
id: opsi

# history_criteria
source: criteria
id: kriteria

# history_bestOption
source: Best: {option}
id: Terbaik: {option}

# history_delete
source: Delete
id: Hapus

# history_errorTitle
source: Could not load history
id: Gagal memuat riwayat

# history_retry
source: Retry
id: Coba lagi

# decision_editor_stepOptions
source: Add options
id: Tambah opsi

# decision_editor_stepCriteria
source: Add criteria & weights
id: Tambah kriteria & bobot

# decision_editor_stepScores
source: Score each option
id: Nilai setiap opsi

# settings_language
source: Language
id: Bahasa

# settings_language_english
source: English
id: Inggris

# settings_language_indonesian
source: Indonesian
id: Indonesia

# login_title
source: Login
id: Masuk

# login_welcome
source: Welcome to Thinkr
id: Selamat datang di Thinkr

# login_signInWithGoogle
source: Sign in with Google
id: Masuk dengan Google

# decision_editor_title
source: Decision editor
id: Editor keputusan

# decision_editor_subtitle
source: Add options, criteria, weights, and scores to get a ranked recommendation.
id: Tambah opsi, kriteria, bobot, dan skor untuk mendapat rekomendasi peringkat.

# decision_editor_evaluate
source: Evaluate
id: Evaluasi

# decision_editor_evaluating
source: Evaluating...
id: Memproses...

# decision_editor_save
source: Save decision
id: Simpan keputusan

# decision_editor_saving
source: Saving...
id: Menyimpan...

# decision_editor_saved
source: Decision saved
id: Keputusan tersimpan

# decision_editor_defaultTitle
source: Untitled decision
id: Keputusan tanpa judul

# decision_editor_evaluatedChip
source: Evaluated
id: Sudah dievaluasi

# decision_editor_titleLabel
source: Title
id: Judul

# decision_editor_titleHint
source: What are you deciding?
id: Apa yang ingin kamu putuskan?

# decision_editor_optionsTitle
source: Options
id: Opsi

# decision_editor_optionsDescription
source: List every option you're considering.
id: Daftar semua opsi yang dipertimbangkan.

# decision_editor_optionHint
source: Add an option
id: Tambah opsi

# decision_editor_addOption
source: Add option
id: Tambah opsi

# decision_editor_noOptions
source: No options yet. Add at least two to compare.
id: Belum ada opsi. Tambah setidaknya dua untuk dibandingkan.

# decision_editor_criteriaTitle
source: Criteria & weights
id: Kriteria & bobot

# decision_editor_criteriaDescription
source: What matters? Set a relative weight for each criterion.
id: Hal apa yang penting? Atur bobot relatif tiap kriteria.

# decision_editor_criterionHint
source: Add a criterion
id: Tambah kriteria

# decision_editor_weightLabel
source: Weight
id: Bobot

# decision_editor_addCriterion
source: Add criterion
id: Tambah kriteria

# decision_editor_weightsNote
source: Weights are normalized automatically.
id: Bobot dinormalisasi otomatis.

# decision_editor_noCriteria
source: No criteria yet. Add what you care about.
id: Belum ada kriteria. Tambah hal yang kamu nilai.

# decision_editor_remove
source: Remove
id: Hapus

# decision_editor_scoresTitle
source: Scores matrix
id: Matriks skor

# decision_editor_scoresDescription
source: Score each option for every criterion (0-10 works well).
id: Beri skor setiap opsi untuk tiap kriteria (rentang 0-10 cocok).

# decision_editor_scoresEmpty
source: Add at least one option and one criterion to start scoring.
id: Tambahkan minimal satu opsi dan satu kriteria untuk mulai memberi skor.

# decision_editor_scoreOptionHeader
source: Option
id: Opsi

# decision_editor_scoreRange
source: Score must be between 1 and 10.
id: Nilai harus antara 1 sampai 10.

# settings_title
source: Settings
id: Pengaturan

# settings_languageLabel
source: Language
id: Bahasa

# decision_editor_resultTitle
source: Result
id: Hasil

# decision_editor_resultDescription
source: Evaluate to see the weighted ranking.
id: Evaluasi untuk melihat peringkat berbobot.

# decision_editor_bestOption
source: Best option
id: Opsi terbaik

# decision_editor_unknownOption
source: Unknown option
id: Opsi tidak dikenal

# decision_editor_ranking
source: Ranking
id: Peringkat

# decision_editor_descriptionLabel
source: Description
id: Deskripsi

# decision_editor_descriptionHint
source: Add context or constraints (optional).
id: Tambahkan konteks atau batasan (opsional).

# decision_editor_optionLabel
source: Option
id: Opsi

# decision_editor_criterionLabel
source: Criterion
id: Kriteria

# decision_editor_scoreHint
source: Tip: scores can be any numeric scale, e.g., 0-10.
id: Tips: skor bisa pakai skala apa saja, misal 0-10.

# decision_editor_scoreDefaultZero
source: Empty scores count as 0.
id: Skor kosong dihitung 0.

# decision_editor_validationOptions
source: Add at least two options.
id: Tambahkan minimal dua opsi.

# decision_editor_validationCriteria
source: Add at least one criterion.
id: Tambahkan minimal satu kriteria.

# decision_editor_validationScores
source: {count} scores still empty (counted as 0).
id: {count} skor masih kosong (dihitung 0).

# decision_editor_fixValidation
source: Complete the required fields to continue.
id: Lengkapi bagian wajib untuk lanjut.

# decision_editor_templatesTitle
source: Templates
id: Template

# decision_editor_templatesDescription
source: Start from a preset and adjust.
id: Mulai dari preset lalu sesuaikan.

# decision_editor_templateApplied
source: Template applied: {name}
id: Template digunakan: {name}

# decision_editor_templateCareer
source: Career move
id: Pilihan karier

# decision_editor_templateCareerDesc
source: Compare staying, switching, or freelancing.
id: Bandingkan bertahan, pindah, atau freelance.

# decision_editor_templateCareer_optionStay
source: Stay in current role
id: Tetap di peran sekarang

# decision_editor_templateCareer_optionNewCompany
source: Join a new company
id: Gabung perusahaan baru

# decision_editor_templateCareer_optionFreelance
source: Go freelance / consulting
id: Freelance / konsultan

# decision_editor_templateCareer_critComp
source: Compensation
id: Kompensasi

# decision_editor_templateCareer_critGrowth
source: Growth & learning
id: Pertumbuhan & belajar

# decision_editor_templateCareer_critBalance
source: Work-life balance
id: Keseimbangan hidup-kerja

# decision_editor_templateCareer_critStability
source: Stability
id: Stabilitas

# decision_editor_templateProduct
source: Product decision
id: Keputusan produk

# decision_editor_templateProductDesc
source: Build vs buy vs open-source.
id: Bangun vs beli vs open-source.

# decision_editor_templateProduct_optionSaas
source: Buy a SaaS
id: Beli SaaS

# decision_editor_templateProduct_optionBuild
source: Build in-house
id: Bangun internal

# decision_editor_templateProduct_optionOpenSource
source: Adopt open-source
id: Adopsi open-source

# decision_editor_templateProduct_critCost
source: Total cost
id: Biaya total

# decision_editor_templateProduct_critSpeed
source: Time to value
id: Waktu ke nilai

# decision_editor_templateProduct_critScalability
source: Scalability
id: Skalabilitas

# decision_editor_templateProduct_critSupport
source: Support & maintenance
id: Dukungan & pemeliharaan

# decision_editor_templateTravel
source: Travel plan
id: Rencana perjalanan

# decision_editor_templateTravelDesc
source: Pick the best trip style.
id: Pilih gaya liburan terbaik.

# decision_editor_templateTravel_optionBeach
source: Beach / relax
id: Pantai / santai

# decision_editor_templateTravel_optionCity
source: City / culture
id: Kota / budaya

# decision_editor_templateTravel_optionNature
source: Nature / adventure
id: Alam / petualangan

# decision_editor_templateTravel_critBudget
source: Budget
id: Anggaran

# decision_editor_templateTravel_critActivities
source: Activities & experiences
id: Aktivitas & pengalaman

# decision_editor_templateTravel_critWeather
source: Weather preference
id: Preferensi cuaca

# decision_editor_templateTravel_critTravelTime
source: Travel time
id: Waktu perjalanan

# decision_editor_templateFinance
source: Financial move
id: Langkah finansial

# decision_editor_templateFinanceDesc
source: Choose where to allocate funds.
id: Pilih alokasi dana.

# decision_editor_templateFinance_optionIndex
source: Index funds / ETFs
id: Reksa dana indeks / ETF

# decision_editor_templateFinance_optionRealEstate
source: Real estate
id: Properti

# decision_editor_templateFinance_optionCash
source: Cash / savings
id: Tunai / tabungan

# decision_editor_templateFinance_critRisk
source: Risk
id: Risiko

# decision_editor_templateFinance_critReturn
source: Return potential
id: Potensi imbal hasil

# decision_editor_templateFinance_critLiquidity
source: Liquidity
id: Likuiditas

# decision_editor_templateFinance_critHorizon
source: Time horizon
id: Horizon waktu

# docs_title
source: User Guide
id: Panduan Pengguna

# docs_gettingStartedTitle
source: Getting Started
id: Memulai

# docs_gettingStartedItem1
source: Sign in with Google (web redirects, mobile in-app).
id: Masuk dengan Google (web redirect, mobile di dalam aplikasi).

# docs_gettingStartedItem2
source: Home shows hero prompt, recent decisions, quick actions.
id: Beranda menampilkan hero prompt, keputusan terbaru, dan aksi cepat.

# docs_createTitle
source: Create a Decision
id: Buat Keputusan

# docs_createItem1
source: Title & description: title required.
id: Judul & deskripsi: judul wajib diisi.

# docs_createItem2
source: Options: add at least 2.
id: Opsi: tambah minimal 2.

# docs_createItem3
source: Criteria: add weights (1–10) and at least 1 criterion.
id: Kriteria: tambah bobot (1–10) dan minimal 1 kriteria.

# docs_createItem4
source: Scores: fill every option×criterion with scores 1–10.
id: Skor: isi semua pasangan opsi×kriteria dengan skor 1–10.

# docs_createItem5
source: Evaluate runs remote WSM, auto-saves after confirmation.
id: Evaluasi menjalankan WSM di server dan menyimpan otomatis setelah konfirmasi.

# docs_createItem6
source: Unsaved edits trigger discard confirmation on back.
id: Perubahan belum disimpan akan diminta konfirmasi saat kembali.

# docs_templatesTitle
source: Templates
id: Template

# docs_templatesItem1
source: Use Career/Product/Travel/Finance templates to prefill.
id: Gunakan template Karier/Produk/Travel/Finance untuk pra-isi.

# docs_templatesItem2
source: Edit any prefilled values before scoring.
id: Edit nilai yang sudah terisi sebelum memberi skor.

# docs_resultsTitle
source: Results
id: Hasil

# docs_resultsItem1
source: Best option, ranking with scores, meta info shown.
id: Menampilkan opsi terbaik, peringkat dengan skor, dan info meta.

# docs_resultsItem2
source: Debug data from Edge Function when available.
id: Data debug dari Edge Function jika tersedia.

# docs_historyTitle
source: History & Search
id: Riwayat & Pencarian

# docs_historyItem1
source: View saved decisions; mobile infinite scroll, web paging.
id: Lihat keputusan tersimpan; mobile scroll tanpa batas, web halaman.

# docs_historyItem2
source: Search by title/description.
id: Cari berdasarkan judul/deskripsi.

# docs_historyItem3
source: Tap to open result (evaluated) or edit & re-evaluate.
id: Ketuk untuk melihat hasil (jika sudah dievaluasi) atau edit & evaluasi ulang.

# docs_historyItem4
source: Delete performs soft delete.
id: Hapus dilakukan secara soft delete.

# docs_languageTitle
source: Language
id: Bahasa

# docs_languageItem1
source: Switch English/Bahasa via header icon or Settings.
id: Ganti Inggris/Bahasa lewat ikon header atau Pengaturan.

# docs_authTitle
source: Authentication
id: Autentikasi

# docs_authItem1
source: Google Sign-In; logout in header with confirmation.
id: Hanya Google Sign-In; logout di header dengan konfirmasi.

# docs_methodTitle
source: Decision Method
id: Metode Keputusan

# docs_methodItem1
source: Weighted Sum Model: normalize weights, multiply scores (1–10), sum and rank.
id: Weighted Sum Model: normalisasi bobot, kalikan skor (1–10), jumlahkan dan urutkan.

# docs_methodItem2
source: Computed in Supabase Edge Function `evaluate_decision`.
id: Dihitung di Supabase Edge Function `evaluate_decision`.
